/*--<헤더 파일>-------------------------------------------- -----------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

/*--<상수 정의>-------------------------------------------- -----------------*/


/*--<변수>------------------------------- -----------------------*/


/*--<함수 프로토타입>-------------------------------------------- -----------------*/


/*------------------------------------------------ ---------------------------------
* 기능 : score_grade
* 설명 : 문자열 출력
* 입력 매개변수 : psGrade - 문자열, piScore - 상수열
* 출력 매개변수:
* 반환값 :
*-------------------------------------- -------------------*/

void score_grade(int piScore, char* psGrade)
{
    switch (piScore)
    {
	case 90 ... 100:
		*psGrade ='A';
		break;
	case 80 ... 89:
		*psGrade = 'B';
		break;
	case 70 ... 79:
		*psGrade = 'C';
		break;
	case 60 ... 69:
		*psGrade = 'D';
		break;
	case 0 ... 59:
		*psGrade = 'F';
		break;
	default :
		printf("최대점수 100점, 최소점수 0점입니다. 다시 입력해주세요");
		exit(0);
    }
}  /* score_grade의 끝 */

