/*--<헤더 파일>-------------------------------------------- -----------------------*/
#include <stdio.h>
#include "array_funcs.h"

/*--<상수 정의>-------------------------------------------- -----------------*/


/*--<변수>------------------------------- -----------------------*/


/*--<함수 프로토타입>-------------------------------------------- -----------------*/


/*------------------------------------------------ ---------------------------------
* 기능 : 메인
* 설명 : 입력한 값을 배열로 저장뒤 최대값 최소값 알려주기
* 입력 매개변수 : int liMax, int liMin, int liArr
* 출력 매개변수: int piMax, int piMin, int piArr
* 반환값 : SUCCESS - 0(FOK)
* FAIL - 0 없음(FERR)
*-------------------------------------- -------------------*/

int main()
{
    printf("숫자를 입력 후 엔터를 누르시면(숫자 5개) 중에 최대값 최소값을 알려드립니다.\n");

    int liArr[5];

    int liMax = -9999;
    int liMin = 9999;

    int i;
    for (i = 0; i < 5; i++)
    {
        scanf("%d", &liArr[i]);
    }

    array(&liMax, &liMin, liArr);

    printf(" 최대값 : %d\n", liMax);
    printf(" 최소값 : %d\n", liMin);
    return 0;
} /* 메인 끝 */

