/*--<헤더 파일>-------------------------------------------- -----------------------*/
#include <stdio.h>
#include "memory_static.h"

/*--<상수 정의>-------------------------------------------- -----------------*/


/*--<변수>------------------------------- -----------------------*/
char* gspStudyName = NULL;
char* lspStudyArr;

/*--<함수 프로토타입>-------------------------------------------- -----------------*/


/*------------------------------------------------ ---------------------------------
* 기능 : 메인
* 설명 : 정적 메모리 할당 후 free하는 프로그램 
* 입력 매개변수 : gspStudyName, lspStudyArr
* 출력 매개변수: 
* 반환값 : SUCCESS - 0(FOK)
* FAIL - 0 없음(FERR)
*-------------------------------------- -------------------*/

int main()
{
	memory_static_func("C_LANGUGAE");

	memory_static_free((char **)&gspStudyName);

	return 0;

} /* 메인 끝 */
