/*--<헤더 파일>-------------------------------------------- -----------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include "grade_funcs.h"

/*--<상수 정의>-------------------------------------------- -----------------*/


/*--<변수>------------------------------- -----------------------*/


/*--<함수 프로토타입>-------------------------------------------- -----------------*/


/*------------------------------------------------ ---------------------------------
* 기능 : 메인
* 설명 : 성적입력하면 학점알려주는 프로그램
* 입력 매개변수 : int liScore, char lsGrade
* 출력 매개변수: int piScore, char lsGrade
* 반환값 : SUCCESS - 0(FOK)
* FAIL - 0 없음(FERR)
*-------------------------------------- -------------------*/

int main()
{
    printf("점수를 입력하면 학점을 알려드립니다.\n");
    scanf("%d", &liScore);

    score_grade(liScore, &lsGrade);

    printf("당신의 점수는 %d 이고 학점은 %c 입니다.\n", liScore, lsGrade);

    return 0;
}  /* 메인 끝 */


