/*--<헤더 파일>-------------------------------------------- -----------------------*/
#include "write_read.h"
#include <string.h>
#include <stdio.h>

/*--<상수 정의>-------------------------------------------- -----------------*/


/*--<변수>------------------------------- -----------------------*/


/*--<함수 프로토타입>-------------------------------------------- -----------------*/


/*------------------------------------------------ ---------------------------------
* 기능 : 메인
* 설명 : 숫자 입력하면 정렬해주는 프로그
* 입력 매개변수 : int argc, char *argv[]
* 출력 매개변수: 
* 반환값 : SUCCESS - 0(FOK)
* FAIL - 0 없음(FERR)
*-------------------------------------- -------------------*/

int main(int argc, char *argv[])
{
    if (argc != 2)
	{
        printf("Usage: %s <write | read>\n", argv[0]);
        return 1;
    }
    
	if (strcmp(argv[1], "write") == 0)
	{
        writing_process();
    } else if (strcmp(argv[1], "read") == 0) 
	{
        reading_process();
    } else {
        printf("Invalid argument: %s\n", argv[1]);
        return 1;
    }

    return 0;
}/* 메인 끝 */

